# SetControlText

## Description
Sets the text of radio button, check box, push button controls.

```pascal
PROCEDURE SetControlText(
				DlogID  : INTEGER;
				ItemID  : INTEGER;
				newtext : STRING);
```

```python
def vs.SetControlText(DlogID, ItemID, newtext):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|DlogID|INTEGER|ID of the dialog|
|ItemID|INTEGER|ID of the control|
|newtext|STRING|Text to insert|

## Version
Availability: from VectorWorks10.0

## Category
* Dialogs - Modern